---
title: AnalyticalTransferSwitchData
classe: Autodesk.Revit.DB.Electrical.AnalyticalTransferSwitchData
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.Electrical.AnalyticalPowerDistributableNodeData
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# AnalyticalTransferSwitchData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double CurrentRating { get; set; }` | `analyticalTransferSwitchData.CurrentRating` | Double |
| `Double TotalConnectedCurrent { get; }` | `analyticalTransferSwitchData.TotalConnectedCurrent` | Double |
| `Double Voltage { get; set; }` | `analyticalTransferSwitchData.Voltage` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```